-- [[
-- направления для передачи данных через каналы у потоков при перемещении
-- клеток соответственно left, right, up, down из текущего поля
-- draw - таблица с коэффициентами для умножения при рисовании
-- ]]
return {
    -- при работе в одном потоке не используется обмен через каналы
    [1] = { 
        {l = 1, r = 1, u = 1, d = 1, draw = {0, 0 }}, 
    },

    --[[
    -- | 1 | 2 |
    --]]
    [2] = {
        {l = 2, r = 2, draw = {0, 0}}, 
        {l = 1, r = 1, draw = {1, 0}},
    },

    --[[
    -- | 1 | 2 | 3 |
    --]]
    [3] = {
        {l = 3, r = 2, draw = {0, 0}}, 
        {l = 1, r = 3, draw = {1, 0}},
        {l = 2, r = 1, draw = {2, 0}},
    },

    --[[
    -- | 1 | 2 |
    -- | 3 | 4 |
    --]]
    [4] = {
        {l = 2, r = 2, u = 3, d = 3, draw = {0, 0}}, 
        {l = 1, r = 1, u = 4, d = 4, draw = {1, 0}},
        {l = 4, r = 4, u = 1, d = 1, draw = {0, 1}},
        {l = 3, r = 4, u = 2, d = 2, draw = {1, 1}},
    },

    --[[
    -- | 1 | 2 | 3 |
    -- | 4 | 5 | 6 |
    --]]
    [6] = {
        {l = 3, r = 2, u = 4, d = 4, draw = {0, 0}}, 
        {l = 1, r = 3, u = 5, d = 5, draw = {1, 0}},
        {l = 2, r = 1, u = 6, d = 6, draw = {2, 0}},
        {l = 6, r = 5, u = 1, d = 1, draw = {0, 1}},
        {l = 4, r = 6, u = 2, d = 2, draw = {1, 1}},
        {l = 5, r = 6, u = 3, d = 3, draw = {2, 1}},
    },

    --[[
    -- | 1 | 2 | 3 |
    -- | 4 | 5 | 6 |
    -- | 7 | 8 | 9 |
    --]]
    [9] = {
        {l = 3, r = 2, u = 7, d = 4, draw = {0, 0}}, 
        {l = 1, r = 3, u = 8, d = 5, draw = {1, 0}},
        {l = 2, r = 1, u = 9, d = 6, draw = {2, 0}},
        {l = 6, r = 5, u = 1, d = 7, draw = {0, 1}},
        {l = 4, r = 6, u = 2, d = 8, draw = {1, 1}},
        {l = 5, r = 4, u = 3, d = 9, draw = {2, 1}},
        {l = 9, r = 8, u = 4, d = 1, draw = {0, 2}},
        {l = 7, r = 9, u = 5, d = 2, draw = {1, 2}},
        {l = 8, r = 7, u = 6, d = 3, draw = {2, 2}},
    }
}
